/*
  1. Доделать рисование крестика и нолика.
  2*. Вывести победителя
  3***. Нарисовать победную линию

  Поскольку в подготовитльном курсе был урок со схожим заданием,
  только на нем предлагалось реализовать игровое поле в виде
  кнопок, в данной версии я соединил оба варианта - кнопочный
  и рисованный (крестики, нолики, линии), добавив соответствующую
  настройку в параметрах игры
 */
package lesson8;
import lesson8.gamepack.*;

public class WinTicTacToe {
    public static void main(String[] args) {
        new GameWindow();
    }
}
